import { default as baseDict } from './en'

const dict: typeof baseDict = {
	startWithTwitch: 'Начать с помощью Twitch',
	startWithYoutube: 'Начать с помощью YouTube',
	startWithTrovo: 'Начать с помощью Trovo',
	startWithVkplay: 'Начать с помощью VK Play',
	startWithTiktok: 'Начать с помощью TikTok (Beta)',
	scopeTwitch: {
		heading: 'Перед тем, как начать',
		headline: 'Для корректной работы сервиса Uplify нам необходимо ваше разрешение на&nbsp;доступ к&nbsp;статистике вашего канала и&nbsp;отправку сообщений в&nbsp;чате.',
		info: 'Мы&nbsp;уважаем вашу конфиденциальность и&nbsp;крайне бережно относимся к&nbsp;вашим данным.',
		link: 'Почему мы собираем эти данные?',
		desciptions: [
			{
				title: 'Отправка сообщений в&nbsp;чат',
				text: 'Позволяет отправлять сообщения в&nbsp;чате со&nbsp;ссылкой на&nbsp;сайт рекламодателя.',
			},
			{
				title: 'Получение адреса электронной почты',
				text: 'Email запрашивается Uplify для подтверждения регистрации и&nbsp;отправки важных уведомлений.',
			},
			{
				title: 'Просмотр данных модерации канала, включая настройки Модераторов, Банов, Таймаутов и&nbsp;Автомода',
				text: 'Необходимо для правильной работы чатбота и&nbsp;избежания конфликтов с&nbsp;другими чатботами на&nbsp;канале.',
			},
			{
				title: 'Просмотр конфигурации канала',
				text: 'Доступ только для чтения. Позволяет Uplify оптимизировать рекламные показы.',
			},
			{
				title: 'Просмотр сообщений в&nbsp;чате',
				text: 'Позволяет читать сообщения в&nbsp;чате и&nbsp;проводить интерактивные опросы.',
			},
		],
		redirectBtn: 'Перейти на Twitch',
	},
	scopeYoutube: {
		heading: 'Перед тем, как начать',
		headline: 'Для корректной работы сервиса Uplify нам необходимо ваше разрешение на&nbsp;доступ к&nbsp;статистике вашего канала и&nbsp;отправку сообщений в&nbsp;чате.',
		info: 'Мы&nbsp;уважаем вашу конфиденциальность и&nbsp;крайне бережно относимся к&nbsp;вашим данным.',
		link: 'Почему мы собираем эти данные?',
		desciptions: [
			{
				title: 'Управление аккаунтом YouTube',
				text: 'Позволяет нам узнать количество активных зрителей на&nbsp;стриме, читать и&nbsp;отправлять сообщения в&nbsp;чате со&nbsp;ссылкой на&nbsp;сайт спонсора.',
			},
		],
		redirectBtn: 'Перейти на YouTube',
	},
	scopeTrovo: {
		heading: 'Перед тем, как начать',
		headline: 'Для корректной работы сервиса Uplify нам необходимо ваше разрешение на&nbsp;доступ к&nbsp;статистике вашего канала и&nbsp;отправку сообщений в&nbsp;чате.',
		info: 'Мы&nbsp;уважаем вашу конфиденциальность и&nbsp;крайне бережно относимся к&nbsp;вашим данным.',
		link: 'Почему мы собираем эти данные?',
		desciptions: [
			{
				title: 'Получение адреса электронной почты',
				text: 'Email запрашивается Uplify для подтверждения регистрации и&nbsp;отправки важных уведомлений.',
			},
			{
				title: 'Просмотр информации о&nbsp;канале',
				text: 'Доступ только для чтения. Позволяет Uplify оптимизировать рекламные показы.',
			},
			{
				title: 'Отправка сообщений в&nbsp;чат',
				text: 'Позволяет отправлять сообщения в&nbsp;чате со&nbsp;ссылкой на&nbsp;сайт рекламодателя.',
			},
		],
		redirectBtn: 'Перейти на Trovo',
	},
	scopeVkplay: {
		heading: 'Перед тем, как начать',
		headline: 'Для корректной работы сервиса Uplify нам необходимо ваше разрешение на&nbsp;доступ к&nbsp;статистике вашего канала и&nbsp;отправку сообщений в&nbsp;чате.',
		info: 'Мы&nbsp;уважаем вашу конфиденциальность и&nbsp;крайне бережно относимся к&nbsp;вашим данным.',
		link: 'Почему мы собираем эти данные?',
		desciptions: [
			{
				title: 'Получение адреса электронной почты',
				text: 'Email запрашивается Uplify для подтверждения регистрации и&nbsp;отправки важных уведомлений.',
			},
			{
				title: 'Просмотр информации о&nbsp;канале',
				text: 'Доступ только для чтения. Позволяет Uplify оптимизировать рекламные показы.',
			},
			{
				title: 'Отправка сообщений в&nbsp;чат',
				text: 'Позволяет отправлять сообщения в&nbsp;чате со&nbsp;ссылкой на&nbsp;сайт рекламодателя.',
			},
		],
		redirectBtn: 'Перейти на VK Play',
	},
	scopeTiktok: {
		heading: 'Перед тем, как начать',
		headline: 'Для корректной работы сервиса Uplify нам необходимо ваше разрешение на&nbsp;доступ к&nbsp;статистике вашего канала и&nbsp;отправку сообщений в&nbsp;чате.',
		info: 'Мы&nbsp;уважаем вашу конфиденциальность и&nbsp;крайне бережно относимся к&nbsp;вашим данным.',
		link: 'Почему мы собираем эти данные?',
		desciptions: [
			{
				title: 'Получение адреса электронной почты',
				text: 'Email запрашивается Uplify для подтверждения регистрации и&nbsp;отправки важных уведомлений.',
			},
			{
				title: 'Просмотр информации о&nbsp;канале',
				text: 'Доступ только для чтения. Позволяет Uplify оптимизировать рекламные показы.',
			},
			{
				title: 'Отправка сообщений в&nbsp;чат',
				text: 'Позволяет отправлять сообщения в&nbsp;чате со&nbsp;ссылкой на&nbsp;сайт рекламодателя.',
			},
		],
		redirectBtn: 'Перейти на TikTok',
	},
}

export default dict
